# python 中的类型和变量

# 一、整数
# 整数，python可以处理任意大小的整数，包括负整数
# 计算机由于使用二进制，所以，有时候用十六进制表示整数比较方便，十六进制用0x前缀和0-9，a-f表示
# 对于很大的数，例如10000000000，很难数清楚0的个数。Python允许在数字中间以_分隔，
# 因此，写成10_000_000_000和10000000000是完全一样的。十六进制数也可以写成0xa1b2_c3d4


# 二、浮点数，也就是小数
# 按照科学记数法表示时，一个浮点数的小数点位置是可变的，比如，1.23x109和12.3x108是完全相等的。浮点数可以用数学写法，如1.23，3.14，-9.01，
# 整数和浮点数在计算机内部存储的方式是不同的，整数运算永远是精确的（除法难道也是精确的？是的！），而浮点数运算则可能会有四舍五入的误差。


# 三、字符串，以单引号'或双引号"括起来的任意文本，比如'abc'，"xyz"
# 转义字符\可以转义很多字符，比如\n表示换行，\t表示制表符，字符\本身也要转义，所以\\表示的字符就是\
# 如果字符串里面有很多字符都需要转义，就需要加很多\，为了简化，Python还允许用r''表示''内部的字符串默认不转义，：
print('\\\t\\')
print(r'\\\t\\')
# \	\
# \\\t\\

# 如果字符串内部有很多换行，用\n写在一行里不好阅读，为了简化，Python允许用'''...'''的格式表示多行内容
print('''line1
...line2
...line3''')


# 四、布尔值，布尔值和布尔代数的表示完全一致，一个布尔值只有True、False两种值，要么是True，要么是False
# 在Python中可以直接用True和False来表示布尔值，也可以通过布尔运算出来
# 布尔值可以用and、or和not运算
# and运算是与运算，只有所有都为True，and运算结果才是True
var = True or True

# or运算是或运算，只要其中有一个为True，or运算结果就是True
var1 = True or False

# not运算是非运算，它是一个单目运算符，把True变成False，False变成True
print(True and True)    # True
print(True and False)   # False

var2 = not True

# 五、空值空值是Python里一个特殊的值，用None表示。None不能理解为0，因为0是有意义的，而None是一个特殊的空值

# 六、此外Python还提供了列表、字典等多种数据类型，还允许创建自定义数据类型


a = 123
b = 'hello'

a1 = 'ABC'
b1 = a1
a1 = 'XYZ'
print(b1)   # 输出结果是？

# 七、变量 ，变量在程序中就是用一个变量名表示了，变量名必须是大小写英文、数字和_的组合，且不能用数字开头
num = 1
strings = 'jdjdi'
# 这种变量本身类型不固定的语言称之为动态语言，与之对应的是静态语言,
# 静态语言在定义变量时必须指定变量类型，如果赋值的时候类型不匹配，就会报错


# 八、常量，不能改变的变量，通常用全部大写的变量名表示常量

PI = 3.1415
# 但事实上PI仍然是一个变量，Python根本没有任何机制保证PI不会被改变，
# 所以，用全部大写的变量名表示常量只是一个习惯上的用法，如果你一定要改变变量PI的值，也是可以的


# python中的除法，有两种除法，一种除法是/，还有一种除法是//，称为地板除，为//除法只取结果的整数部分。
print(10/3)  # 3.3333333333333335
print(9/3)  # 3.0   /除法计算结果是浮点数，即使是两个整数恰好整除，结果也是浮点数

print(9//3)  # 3
print(10//3)   # 3
# 整数的地板除//永远是整数，即使除不尽
# 无论整数做//除法还是取余数，结果永远是整数，所以，整数运算结果永远是精确的。

#   可以把任何数据都看成一个“对象”，而变量就是在程序中用来指向这些数据对象的，对变量赋值就是把数据和变量给关联起来。
# 在计算机内部，可以把任何数据都看成一个“对象”，
# 而变量就是在程序中用来指向这些数据对象的，对变量赋值就是把数据和变量给关联起来。
