# python 中的类型和变量

# 整数，python可以处理任意大小的整数，包括负整数

# 浮点数，也就是小数
# 按照科学记数法表示时，一个浮点数的小数点位置是可变的，比如，1.23x109和12.3x108是完全相等的。浮点数可以用数学写法，如1.23，3.14，-9.01，
# 整数和浮点数在计算机内部存储的方式是不同的，整数运算永远是精确的（除法难道也是精确的？是的！），而浮点数运算则可能会有四舍五入的误差。


# 字符串，以单引号'或双引号"括起来的任意文本，比如'abc'，"xyz"
# 转义字符\可以转义很多字符，比如\n表示换行，\t表示制表符，字符\本身也要转义，所以\\表示的字符就是\
# 如果字符串里面有很多字符都需要转义，就需要加很多\，为了简化，Python还允许用r''表示''内部的字符串默认不转义，：
print('\\\t\\')
print(r'\\\t\\')
# \	\
# \\\t\\

# 字符串内部有很多换行，用\n写在一行里不好阅读，为了简化，Python允许用'''...'''的格式表示多行内容
print('''line1
line2
line3''')


# 布尔值，布尔值和布尔代数的表示完全一致，一个布尔值只有True、False两种值，要么是True，要么是False
# 布尔值可以用and、or和not运算
# and运算是与运算，只有所有都为True，and运算结果才是True
# or运算是或运算，只要其中有一个为True，or运算结果就是True
# not运算是非运算，它是一个单目运算符，把True变成False，False变成True
print(True and True)    # True
print(True and False)   # False


# 空值空值是Python里一个特殊的值，用None表示。
# None不能理解为0，因为0是有意义的，而None是一个特殊的空值


# 这种变量本身类型不固定的语言称之为动态语言，与之对应的是静态语言
a = 123
b = 'hello'

a1 = 'ABC'
b1 = a1
a1 = 'XYZ'
print(b1)   # 输出结果是？

# 常量，不能改变的变量，通常用全部大写的变量名表示常量
PI = 3.1415
# 但事实上PI仍然是一个变量，Python根本没有任何机制保证PI不会被改变，
# 所以，用全部大写的变量名表示常量只是一个习惯上的用法，如果你一定要改变变量PI的值，也是可以的


# python中的除法，有两种除法，一种除法是/，还有一种除法是//，称为地板除，为//除法只取结果的整数部分。
print(10/3) # 3.3333333333333335

print(9//3)  # 3
print(10//3)   # 3
# 无论整数做//除法还是取余数，结果永远是整数，所以，整数运算结果永远是精确的。

#   可以把任何数据都看成一个“对象”，而变量就是在程序中用来指向这些数据对象的，对变量赋值就是把数据和变量给关联起来。
