#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
	IO流操作：
		IO在计算机中指Input/Output，也就是输入和输出。
		IO编程中，Stream（流）是一个很重要的概念，可以把流想象成一个水管，数据就是水管里的水，但是只能单向流动。
		Input Stream就是数据从外面（磁盘、网络）流进内存，Output Stream就是数据从内存流到外面去。
		由于CPU和内存的速度远远高于外设的速度，所以，在IO编程中，就存在速度严重不匹配的问题

		第一种是CPU等着，也就是程序暂停执行后续代码，等100M的数据在10秒后写入磁盘，再接着往下执行，这种模式称为同步IO
		另一种方法是CPU不等待，只是告诉磁盘，“您老慢慢写，不着急，我接着干别的事去了”，于是，后续代码可以立刻接着执行，这种模式称为异步IO。

		同步和异步的区别就在于是否等待IO执行的结果。

		异步IO的复杂度远远高于同步IO。

	pythonIO操作：
		读写文件是最常见的IO操作。Python内置了读写文件的函数，用法和C是兼容的。
		读写文件前，我们先必须了解一下，在磁盘上读写文件的功能都是由操作系统提供的，现代操作系统不允许普通的程序直接操作磁盘，
		所以，读写文件就是请求操作系统打开一个文件对象（通常称为文件描述符），然后，通过操作系统提供的接口从这个文件对象中读取数据（读文件），
		或者把数据写入这个文件对象（写文件）。

	读文件：
		方法：要以读文件的模式打开一个文件对象，使用Python内置的open()函数，传入文件名和标示符
			f = open('/Users/michael/test.txt', 'r')，标示符'r'表示读，这样，我们就成功地打开了一个文件。
		结果１：如果文件不存在，open()函数就会抛出一个IOError的错误，并且给出错误码和详细的信息告诉你文件不存在：
		结果２：如果文件打开成功，接下来，调用read()方法可以一次读取文件的全部内容，
				Python把内容读到内存，用一个str对象表示：


"""
